
osakanas = [
 {
   "Fish": "ファットパース",
   "Spot": "",
   "Zone": "西部高地",
   "Time": "なし",
   "Weather": "なし"
 },
 {
   "Fish": "ラ・レアル",
   "Spot": "",
   "Zone": "西部高地",
   "Time": "なし",
   "Weather": "なし"
 },
 {
   "Fish": "イエティキラー",
   "Spot": "",
   "Zone": "西部高地",
   "Time": "なし",
   "Weather": "なし"
 },
 {
   "Fish": "メテオトータス",
   "Spot": "モーン大岩窟",
   "Zone": "高地ドラ",
   "Time": "08:00-16:00",
   "Weather": "なし"
 },
 {
   "Fish": "溶岩帝王",
   "Spot": "光輪の祭壇",
   "Zone": "高地ドラ",
   "Time": "08:00-16:00",
   "Weather": "晴れ・快晴"
 },
 {
   "Fish": "水瓶王",
   "Spot": "サリャク河",
   "Zone": "低地ドラ",
   "Time": "なし",
   "Weather": "なし"
 },
 {
   "Fish": "ハイアラガンクラブ改",
   "Spot": "アルファ管区",
   "Zone": "アジスラ",
   "Time": "なし",
   "Weather": "なし"
 },
 {
   "Fish": "魔科学物質666",
   "Spot": "廃液溜まり",
   "Zone": "アジスラ",
   "Time": "なし",
   "Weather": "なし"
 },
 {
   "Fish": "ハンドレッドアイ",
   "Spot": "パプスの大樹",
   "Zone": "アジスラ",
   "Time": "06:00-10:00",
   "Weather": "なし"
 },
 {
   "Fish": "ヴィゾーヴニル",
   "Spot": "",
   "Zone": "ドラ雲海",
   "Time": "08:00-10:00",
   "Weather": "なし"
 },
 {
   "Fish": "フックスティーラー",
   "Spot": "",
   "Zone": "ラルガ",
   "Time": "なし",
   "Weather": "なし"
 },
 {
   "Fish": "ナガレクダリ",
   "Spot": "スロウウォッシュ",
   "Zone": "ギラ山岳",
   "Time": "08:00-12:00",
   "Weather": "なし"
 },
 {
   "Fish": "七彩天主",
   "Spot": "七彩溝",
   "Zone": "ヤンサ",
   "Time": "なし",
   "Weather": "なし"
 },
 {
   "Fish": "ノボリリュウ",
   "Spot": "波止場全体",
   "Zone": "クガネ",
   "Time": "なし",
   "Weather": "なし"
 },
 {
   "Fish": "バクチウチ",
   "Spot": "シロガネ",
   "Zone": "シロガネ",
   "Time": "なし",
   "Weather": "なし"
 },
 {
   "Fish": "プロブレマティカス",
   "Spot": "光輪の祭壇",
   "Zone": "高地ドラ",
   "Time": "10:00-15:00",
   "Weather": "晴れ・快晴"
 },
 {
   "Fish": "シーロストラタスモトロ",
   "Spot": "クラウドトップ",
   "Zone": "アバ雲海",
   "Time": "10:00-13:00",
   "Weather": "晴れ・快晴"
 },
 {
   "Fish": "フォークタン",
   "Spot": "",
   "Zone": "高地ドラ",
   "Time": "12:00-16:00",
   "Weather": "快晴"
 },
 {
   "Fish": "アークビショップフィッシュ",
   "Spot": "流星の尾",
   "Zone": "ギラ辺境",
   "Time": "12:00-16:00",
   "Weather": "雷・晴れ・快晴"
 },
 {
   "Fish": "ボクデン",
   "Spot": "ドマ城前",
   "Zone": "ヤンサ",
   "Time": "12:00-14:00",
   "Weather": "なし"
 },
 {
   "Fish": "水墨魚",
   "Spot": "",
   "Zone": "アバ雲海",
   "Time": "14:00-16:00",
   "Weather": "晴れ・快晴"
 },
 {
   "Fish": "アラガンブレード・シャーク",
   "Spot": "アジス・ラー旗艦島",
   "Zone": "アジスラ",
   "Time": "なし",
   "Weather": "(曇り →) 雷"
 },
 {
   "Fish": "オパビニア",
   "Spot": "アジス・ラー旗艦島",
   "Zone": "アジスラ",
   "Time": "なし",
   "Weather": "雷"
 },
 {
   "Fish": "サーメットヘッド",
   "Spot": "ティモン川",
   "Zone": "ギラ辺境",
   "Time": "16:00-20:00",
   "Weather": "なし"
 },
 {
   "Fish": "クセナカンサス",
   "Spot": "ティモン川",
   "Zone": "ギラ辺境",
   "Time": "16:00-20:00",
   "Weather": "なし"
 },
 {
   "Fish": "春不知",
   "Spot": "沖之岩近海",
   "Zone": "紅玉海",
   "Time": "16:00-20:00",
   "Weather": "なし"
 },
 {
   "Fish": "トラマフィッシュ",
   "Spot": "",
   "Zone": "高地ラノ",
   "Time": "17:00-20:00",
   "Weather": "曇り・霧"
 },
 {
   "Fish": "セティ",
   "Spot": "超星間交信塔",
   "Zone": "アジスラ",
   "Time": "18:00-22:00",
   "Weather": "(曇り →) 雷"
 },
 {
   "Fish": "シンタクヤブリ",
   "Spot": "タオ・カール",
   "Zone": "アジステ",
   "Time": "20:00-24:00",
   "Weather": "なし"
 },
 {
   "Fish": "ヘイルイーター",
   "Spot": "",
   "Zone": "西部高地",
   "Time": "なし",
   "Weather": "吹雪"
 },
 {
   "Fish": "シャリベネ",
   "Spot": "",
   "Zone": "西部高地",
   "Time": "なし",
   "Weather": "吹雪"
 },
 {
   "Fish": "アクムノタネ",
   "Spot": "",
   "Zone": "高地ドラ",
   "Time": "22:00-02:00",
   "Weather": "曇り・霧・砂塵"
 },
 {
   "Fish": "スケイルリッパー",
   "Spot": "",
   "Zone": "高地ドラ",
   "Time": "なし",
   "Weather": "曇り・霧・砂塵"
 },
 {
   "Fish": "バスキングシャーク",
   "Spot": "",
   "Zone": "アバ雲海",
   "Time": "なし",
   "Weather": "(霧 →) 快晴"
 },
 {
   "Fish": "ラストティアー",
   "Spot": "ヒース滝",
   "Zone": "ギラ山岳",
   "Time": "なし",
   "Weather": "(霧 →) 晴れ"
 },
 {
   "Fish": "ダイヤモンドアイ",
   "Spot": "ロッホ・セル湖",
   "Zone": "ギラ湖畔",
   "Time": "なし",
   "Weather": "快晴"
 },
 {
   "Fish": "ウミダイジャ",
   "Spot": "オノコロ島近海",
   "Zone": "紅玉海",
   "Time": "なし",
   "Weather": "(晴れ・快晴 →) 風"
 },
 {
   "Fish": "ザクロウミ",
   "Spot": "アオサギ池",
   "Zone": "ヤンサ",
   "Time": "なし",
   "Weather": "雨"
 },
 {
   "Fish": "聖竜の涙",
   "Spot": "モーン大岩窟",
   "Zone": "高地ドラ",
   "Time": "02:00-06:00",
   "Weather": "なし"
 },
 {
   "Fish": "ヒメダカ",
   "Spot": "シロガネ水路",
   "Zone": "クガネ",
   "Time": "04:00-06:00",
   "Weather": "なし"
 },
 {
   "Fish": "クラウドバタフライ",
   "Spot": "",
   "Zone": "アバ雲海",
   "Time": "05:00-07:00",
   "Weather": "快晴"
 },
 {
   "Fish": "ランデロプテルス",
   "Spot": "サルウーム・カシュ",
   "Zone": "ドラ雲海",
   "Time": "05:00-08:00",
   "Weather": "暴風"
 },
 {
   "Fish": "羽衣鯉",
   "Spot": "梅泉郷",
   "Zone": "ヤンサ",
   "Time": "なし",
   "Weather": "霧"
 },
 {
   "Fish": "フレアフィッシュ",
   "Spot": "",
   "Zone": "西部高地",
   "Time": "10:00-16:00",
   "Weather": "吹雪"
 },
 {
   "Fish": "ニジノヒトスジ",
   "Spot": "七彩渓谷",
   "Zone": "ヤンサ",
   "Time": "12:00-16:00",
   "Weather": "霧"
 },
 {
   "Fish": "クリスタルピジョン",
   "Spot": "ハビスフィア",
   "Zone": "アジスラ",
   "Time": "なし",
   "Weather": "(晴れ →) 雷"
 },
 {
   "Fish": "シデンナマズ",
   "Spot": "ラールガーズリーチ",
   "Zone": "ラルガ",
   "Time": "なし",
   "Weather": "雷"
 },
 {
   "Fish": "サファイアファン",
   "Spot": "夜の森",
   "Zone": "ギラ辺境",
   "Time": "なし",
   "Weather": "雷"
 },
 {
   "Fish": "ボンドスプリッター",
   "Spot": "夫婦池",
   "Zone": "ギラ山岳",
   "Time": "なし",
   "Weather": "砂塵"
 },
 {
   "Fish": "ドレパナスピス",
   "Spot": "夫婦池",
   "Zone": "ギラ山岳",
   "Time": "なし",
   "Weather": "砂塵"
 },
 {
   "Fish": "仙寿の翁",
   "Spot": "ナマイ村溜池",
   "Zone": "ヤンサ",
   "Time": "20:00-24:00",
   "Weather": "快晴"
 },
 {
   "Fish": "スピーカー",
   "Spot": "サリャク河上流",
   "Zone": "低地ドラ",
   "Time": "なし",
   "Weather": "暴雨"
 },
 {
   "Fish": "バイオガピラルク",
   "Spot": "デルタ管区",
   "Zone": "アジスラ",
   "Time": "21:00-02:00",
   "Weather": "曇り"
 },
 {
   "Fish": "レッドテイルゾンビー",
   "Spot": "",
   "Zone": "ラルガ",
   "Time": "08:00-12:00",
   "Weather": "曇り"
 },
 {
   "Fish": "ベジースキッパー",
   "Spot": "ネム・カール",
   "Zone": "アジステ",
   "Time": "08:00-12:00",
   "Weather": "(晴れ →) 快晴"
 },
 {
   "Fish": "羽衣美女",
   "Spot": "無二江西",
   "Zone": "ヤンサ",
   "Time": "なし",
   "Weather": "(曇り →) 晴れ・快晴"
 },
 {
   "Fish": "マダムバタフライ",
   "Spot": "クイックスピル・デルタ",
   "Zone": "低地ドラ",
   "Time": "21:00-02:00",
   "Weather": "快晴"
 },
 {
   "Fish": "鎧魚",
   "Spot": "サリャク河上流",
   "Zone": "低地ドラ",
   "Time": "01:00-04:00",
   "Weather": "快晴"
 },
 {
   "Fish": "ラタトスクソウル",
   "Spot": "",
   "Zone": "ドラ雲海",
   "Time": "04:00-06:00",
   "Weather": "晴れ・快晴"
 },
 {
   "Fish": "解脱魚",
   "Spot": "裁定者の像",
   "Zone": "ギラ山岳",
   "Time": "なし",
   "Weather": "(曇り・霧・風・砂塵 →) 快晴"
 },
 {
   "Fish": "ソクシツキ",
   "Spot": "ゼッキ島近海",
   "Zone": "紅玉海",
   "Time": "なし",
   "Weather": "雷"
 },
 {
   "Fish": "アラミガンベール",
   "Spot": "アームズ・オブ・ミード",
   "Zone": "ギラ山岳",
   "Time": "なし",
   "Weather": "(快晴 →) 晴れ"
 },
 {
   "Fish": "スウィートニュート",
   "Spot": "",
   "Zone": "ラベ",
   "Time": "23:00-04:00",
   "Weather": "霧"
 },
 {
   "Fish": "シャジクノミ",
   "Spot": "無二江東",
   "Zone": "ヤンサ",
   "Time": "00:00-06:00",
   "Weather": "(曇り →) 晴れ"
 },
 {
   "Fish": "リドル",
   "Spot": "アネス・ソー",
   "Zone": "高地ドラ",
   "Time": "08:00-16:00",
   "Weather": "(快晴 →) 快晴"
 },
 {
   "Fish": "オニニラミ",
   "Spot": "アオサギ川",
   "Zone": "ヤンサ",
   "Time": "なし",
   "Weather": "(晴れ →) 快晴"
 },
 {
   "Fish": "ザ・セカンドワン",
   "Spot": "",
   "Zone": "アバ雲海",
   "Time": "なし",
   "Weather": "風"
 },
 {
   "Fish": "タニクダリ",
   "Spot": "ベロジナ川",
   "Zone": "ギラ辺境",
   "Time": "なし",
   "Weather": "霧"
 },
 {
   "Fish": "ヘモン",
   "Spot": "",
   "Zone": "ギラ山岳",
   "Time": "16:00-20:00",
   "Weather": "曇り"
 },
 {
   "Fish": "ナナツボシ",
   "Spot": "ベッコウ島近海",
   "Zone": "紅玉海",
   "Time": "10:00-18:00",
   "Weather": "(雷 →) 晴れ"
 },
 {
   "Fish": "ディモルフォドン",
   "Spot": "フィッシュアイ",
   "Zone": "ドラ雲海",
   "Time": "なし",
   "Weather": "(快晴 →) 暴風"
 },
 {
   "Fish": "ストームブラッドライダー",
   "Spot": "サルウーム・カシュ",
   "Zone": "ドラ雲海",
   "Time": "なし",
   "Weather": "(快晴 →) 暴風"
 },
 {
   "Fish": "モグルグポンポン",
   "Spot": "",
   "Zone": "ドラ雲海",
   "Time": "10:00-13:00",
   "Weather": "(暴風 →) 快晴"
 },
 {
   "Fish": "氷の巫女",
   "Spot": "",
   "Zone": "西部高地",
   "Time": "なし",
   "Weather": "(雪 →) 吹雪"
 },
 {
   "Fish": "ネモ",
   "Spot": "",
   "Zone": "西部高地",
   "Time": "なし",
   "Weather": "(雪 →) 吹雪"
 },
 {
   "Fish": "ヤトカガン",
   "Spot": "ヤト・カール下流",
   "Zone": "アジステ",
   "Time": "なし",
   "Weather": "風"
 },
 {
   "Fish": "バリマンボン",
   "Spot": "イサリ村沿岸",
   "Zone": "紅玉海",
   "Time": "16:00-24:00",
   "Weather": "(晴れ・快晴 →) 雷"
 },
 {
   "Fish": "コープスチャブ",
   "Spot": "ミラージュクリーク",
   "Zone": "ギラ辺境",
   "Time": "20:00-24:00",
   "Weather": "快晴"
 },
 {
   "Fish": "菜食王",
   "Spot": "獄之蓋近海",
   "Zone": "紅玉海",
   "Time": "20:00-24:00",
   "Weather": "雷"
 },
 {
   "Fish": "ステタカントゥス",
   "Spot": "ロッホ・セル湖",
   "Zone": "ギラ湖畔",
   "Time": "16:00-18:00",
   "Weather": "(Thunderstorms →) 何でも"
 },
 {
   "Fish": "ビショップフィッシュ",
   "Spot": "",
   "Zone": "西部高地",
   "Time": "10:00-14:00",
   "Weather": "快晴"
 },
 {
   "Fish": "明けの旗魚",
   "Spot": "ハク・カール",
   "Zone": "アジステ",
   "Time": "00:00-08:00",
   "Weather": "(晴れ →) 霧"
 },
 {
   "Fish": "ブレードスキッパー",
   "Spot": "ヤト・カール上流",
   "Zone": "アジステ",
   "Time": "04:00-08:00",
   "Weather": "霧"
 },
 {
   "Fish": "水天一碧",
   "Spot": "城下船場",
   "Zone": "ヤンサ",
   "Time": "16:00-24:00",
   "Weather": "暴雨"
 },
 {
   "Fish": "クアル",
   "Spot": "紅玉台場近海",
   "Zone": "紅玉海",
   "Time": "00:00-08:00",
   "Weather": "(雷 →) 曇り"
 },
 {
   "Fish": "紅龍",
   "Spot": "紅玉台場近海",
   "Zone": "紅玉海",
   "Time": "04:00-08:00",
   "Weather": "(雷 →) 曇り"
 },
 {
   "Fish": "サンダースケイル",
   "Spot": "",
   "Zone": "高地ドラ",
   "Time": "06:00-08:00",
   "Weather": "(曇り・霧・砂塵 →) 雷"
 },
 {
   "Fish": "ナーマの愛寵",
   "Spot": "ドタール・カー",
   "Zone": "アジステ",
   "Time": "04:00-08:00",
   "Weather": "(雨 →) 晴れ・快晴"
 },
 {
   "Fish": "神々の愛",
   "Spot": "ドタール・カー",
   "Zone": "アジステ",
   "Time": "05:00-07:00",
   "Weather": "(雨 →) 快晴"
 },
 {
   "Fish": "暮れの魚",
   "Spot": "アジム・カート",
   "Zone": "アジステ",
   "Time": "08:00-16:00",
   "Weather": "(暴風 →) 曇り"
 },
 {
   "Fish": "パイッサキラー",
   "Spot": "",
   "Zone": "アバ雲海",
   "Time": "08:00-12:00",
   "Weather": "(霧 →) 快晴"
 },
 {
   "Fish": "ボサボサ",
   "Spot": "ウェストン・ウォーター",
   "Zone": "ドラ雲海",
   "Time": "なし",
   "Weather": "(曇り →) 暴風"
 },
 {
   "Fish": "万能のゴブリバス",
   "Spot": "サリャク河中州",
   "Zone": "低地ドラ",
   "Time": "02:00-06:00",
   "Weather": "(雨 →) 暴雨"
 }
]
